app/Controllers/Home.php

SELECT *
FROM `categories`
WHERE `type` = 'expense'
SELECT `categories`.`name`, SUM(transactions.amount) as total_expense
FROM `transactions`
JOIN `categories` ON `categories`.`category_id` = `transactions`.`category_id`
WHERE `categories`.`type` = 'expense'
AND `transactions`.`user_id` = '1'
GROUP BY `categories`.`category_id`
---
    public function index()
    {
        // Pastikan pengguna sudah login
        if (!session()->has('user_id')) {
            return redirect()->to('/login');
        }

        $categoryModel = new CategoryModel();
        $transactionModel = new TransactionModel();

        // Ambil daftar kategori untuk form
        $data['categories'] = $categoryModel->where('type', 'expense')->findAll();

        // Ambil data untuk grafik: total pengeluaran per kategori
        $data['chart_data'] = $transactionModel
            ->select('categories.name, SUM(transactions.amount) as total_expense')
            ->join('categories', 'categories.category_id = transactions.category_id')
            ->where('categories.type', 'expense')
            ->where('transactions.user_id', session()->get('user_id'))
            ->groupBy('categories.category_id')
            ->findAll();