app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `email` = 'yoga@gmail.com'
 LIMIT 1
---
    public function doLogin()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cari pengguna berdasarkan email
        $user = $model->where('email', $email)->first();

INSERT INTO `users` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Yoga', 'yoga@gmail.com', '$2y$10$p9nh3XKaN1KvtJg/kTnqOedzmjEY8/X7KedY8htZyAfHbwdAxK/ju', '2025-05-23 15:47:53', '2025-05-23 15:47:53')
---
    public function doRegister()
    {
        $model = new UserModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT)
        ];

        // Validasi input
        $validation = \Config\Services::validation();
        $validation->setRules([
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]'
        ]);

        if (!$validation->run($data)) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // Simpan pengguna
        $model->insert($data);